{"1. Why Angular?":[{"title":"Why Angular?","content":"\nJavaScript is the most commonly used client-side scripting language. It is written into HTML documents to enable interactions with web pages in many unique ways. As a relatively easy-to-learn language with pervasive support, it is well-suited to develop modern applications. But is JavaScript ideal for developing single-page applications that require modularity, testability, and developer productivity? Perhaps not. These days, we have a variety of frameworks and libraries designed to provide alternative solutions. With respect to front-end web development, Angular addresses many, if not all, of the issues developers face when using JavaScript on its own.\n\nAngular Provide a collection of integrated libraries that cover a wide variety of features, including: routing forms management client server communication and more. Angular is designed to make updating as straightforward as possible so take advantage of the latest features development tools and libraries.\n","section":"1. Why Angular?","source":"https://www.simplilearn.com/"}],"10. What are the directive":[{"title":"What are the directives ?","content":"\nDirectives are classes that add new behavior or modify the existing behavior to the elements in the template. Basically directives are used to manipulate the DOM, for example adding/removing the element from DOM or changing the appearance of the DOM elements.\n\n**Example of Angular directive**\n\n```ts\n@Component({\n\tselector: 'my-app',\n\ttemplate: `\n\t\t<ul>\n\t\t\t<li *ngFor=\"let name of names\">\n\t\t\t\t{{ name }}\n\t\t\t</li>\n\t\t</ul>\n\t`,\n})\nexport class AppComponent {\n\tnames: string[]\n\tconstructor() {\n\t\tthis.names = ['John', 'Mary', 'Mike']\n\t}\n}\n```\n\nIn this above code, the `*ngFor` directive is used to iterate over the names array and display the names in the template.\n","section":"10. What are the directive","source":"https://angular.io"}],"11. What are the order of angular lifecycle hooks execution":[{"title":"What are the order of angular lifecycle hooks execution ?","content":"\nAngular gives us 8 hooks to allow us to tap into the lifecycle of our components and trigger actions at specific points in the lifecycle.\n\nHere are the lifecycle hooks available , in the order which they are invoked:\n\n1. ngOnChanges\n2. ngOnInit\n3. ngDoCheck\n4. ngAfterContentInit\n5. ngAfterContentChecked\n6. ngAfterViewInit\n7. ngAfterViewChecked\n8. ngOnDestroy\n\n**ngOnChanges** Called every time a data-bound input property changes. It’s called a first time before the ngOnInit hook. The hook receives a SimpleChanges object that contains the previous and current values for the data-bound inputs properties. This hook gets called often, so it’s a good idea to limit the amount of processing it does.\n\n**ngOnInit** Called once upon initialization of the component.\n\n**ngDoCheck** Use this hook instead of ngOnChanges for changes that Angular doesn’t detect. It gets called at every change detection cycle, so keeping what it does to a minimum is important for performance.\n\n**ngAfterContentInit** Called after content is projected in the component.\n\n**ngAfterContentChecked** Called after the projected content is checked.\n\n**ngAfterViewInit** Called after a component’s view or child view is initialized.\n\n**ngAfterViewChecked** Called after a component’s view or child view is checked.\n\n**ngOnDestroy** Called once when the component is destroyed and a good hook to use to cleanup and unsubscribe from observables.\n","section":"11. What are the order of angular lifecycle hooks execution","source":"https://angular.io"}],"12. What is lifecycle hooks":[{"title":"What is lifecycle hooks ?","content":"\nThe lifecycle of a component/directive is managed by Angular as it creates, checks, updates, renders, and destroys. To have a view of all these occurrences and respond to these moments, Angular provides lifecycle hooks that give us visibility into these. These lifecycle hooks can be implemented by the interfaces provided in the Angular Core Library. This is the same with components and directives. Every interface contains different lifecycle hook methods, named with the interface name prefixed with ng. Like the very commonly used lifecycle hook ngOnInit() is named as ng(prefix) and OnInit (interface name).\n","section":"12. What is lifecycle hooks","source":"https://www.dotnettricks.com"}],"13. What is change detection ?":[{"title":"What is change detection ?","content":"\nChange detection is the process through which angular checks to see whether your applications state has changed, and if any DOM needs to be update.\n","section":"13. What is change detection ?","source":"https://angular.io"}],"14. What is the use of ngOnChanges?":[{"title":"What is the use of ngOnChanges?","content":"\n`ngOnChanges` triggers following the modification of @Input bound class members. Data bound by the @Input() decorator come from an external source. When the external source alters that data in a detectable manner, it passes through the @Input property again.\n\nThe ngOnChanges hook, with it’s SimpleChanges object, is a little different. Here’s how you would implement it. Let’s say we have a component used like this:\n\n```html\n<my-todo [title]=\"title\" [content]=\"content\"></my-todo>\n```\n\nNow say that we want to do something when the title property changes:\n\n```ts\n@Component({\n\tselector: 'my-todo',\n\ttemplateUrl: './my-todo.component.html',\n\tstyleUrls: ['./my-todo.component.css'],\n})\nexport class MyTodoComponent implements OnChanges {\n\t@Input() title: string\n\t@Input() content: string\n\tconstructor() {}\n}\n```\n","section":"14. What is the use of ngOnChanges?","source":"https://angular.io"}],"15. Difference between Constructor and ngOnInit":[{"title":"Difference between Constructor and ngOnInit ?","content":"\nThe Constructor is a default method of the class that is executed when the class is instantiated and ensures proper initialisation of fields in the class and its subclasses. Angular, or better Dependency Injector (DI), analyses the constructor parameters and when it creates a new instance by calling new MyClass() it tries to find providers that match the types of the constructor parameters, resolves them and passes them to the constructor.\n\nngOnInit is a life cycle hook called by Angular to indicate that Angular is done creating the component.\n","section":"15. Difference between Constructor and ngOnInit","source":"https://angular.io"}],"16. What is the use of app root in Angular?":[{"title":"What is the use of app root in Angular?","content":"\nThe root app module is just the beginning. It is a necessary part of any Angular app, but it is also just the entry point to the rest of your app's feature modules.\n","section":"16. What is the use of app root in Angular?","source":"https://angular.io"}],"17. What is Ahead of Time (AOT) compiler ?":[{"title":"What is Ahead of Time (AOT) compiler ?","content":"\nwhen you serve/build your angular application, the Ahead of Time compiler converts your code during the build time before your browser downloads and runs that code. From Angular 9, by default compiling option is set to true for ahead of time compiler.\n","section":"17. What is Ahead of Time (AOT) compiler ?","source":"https://angular.io"}],"18. What is the Just in Time (JIT) compiler ?":[{"title":"What is the Just in Time (JIT) compiler ?","content":"\nJust in time compiler provides compilation during the execution of the program at a run time before execution. In simple words, code get compiles when it’s needed, not at the build time. Initially, compiler was responsible for converting a high-level language into machine language, which would then be converted into executable code.\nJust in time compiler, compiles code at runtime which means instead of interpreting byte code at build time, it will compile byte code when that component is called\n","section":"18. What is the Just in Time (JIT) compiler ?","source":"https://angular.io"}],"19. What is the entry point of Angular application?":[{"title":"What is the entry point of Angular application?","content":"\nA bootstrapped component is an entry component that Angular loads into the DOM during the bootstrap process (application launch). Other entry components are loaded dynamically by other means, such as with the router. Angular loads a root AppComponent dynamically because it's listed by type in @NgModule. bootstrap .\n","section":"19. What is the entry point of Angular application?","source":"https://angular.io"}],"2. What is TypeScript and why it is used?":[{"title":"What is TypeScript and why it is used?","content":"\nTypeScript is a programming language first developed by Microsoft in 2012. Its main ambition is to improve the productivity of developing complex applications.\nIt is an open-source language developed as a superset of JavaScript. What this means in simple terms is that any code valid in JavaScript is also valuable for TypeScript.\n\n### Example\n\n**Without typescript**\n\n```js\nvar x = 1\nvar y = 2\n```\n\n**With typescript**\n\n```ts\nvar x: number = 1\nvar y: number = 2\n```\n","section":"2. What is TypeScript and why it is used?","source":"https://www.codemotion.com/"}],"20. What is destroy in Angular?":[{"title":"What is destroy in Angular?","content":"\nA lifecycle hook that is called when a directive, pipe, or component is destroyed. The ngOnDestroy or OnDestroy hook is called just before the Component/Directive instance is destroyed by Angular. Use this hook to Perform any cleanup logic for the Component. This is the correct place where you would like to Unsubscribe Observables and detach event handlers to avoid memory leaks.\n","section":"20. What is destroy in Angular?","source":"https://angular.io"}],"3. What is Components?":[{"title":"What is Components?","content":"\nIn Angular, Components are the most basic UI building block of an Angular app. An Angular app contains a tree of Angular components. Angular components are a subset of directives, always associated with a template. Unlike other directives, only one component can be instantiated for a given element in a template.\n\n- Components are typically custom HTML elements, and each of these elements can instantiate only one component.\n- A TypeScript class is used to create a component. This class is then decorated with the `@Component` decorator. The decorator accepts a metadata object that gives information about the component.\n- A component must belong to the NgModule in order for it to be usable by another component or application.\n- Components control their runtime behavior by implementing Life-Cycle hooks.\n\n**Example of an Component**\n\n```TypeScript\n@Component({\n  selector: 'app-root',\n  templateUrl: './app.component.html',\n  styleUrls: ['./app.component.css']\n})\nexport class AppComponent {\n  title = 'Angular';\n}\n```\n","section":"3. What is Components?","source":"https://angular.io"}],"4. What Is Angular?":[{"title":"What Is Angular?","content":"\nAngular is an open-source, JavaScript framework written in TypeScript. Google maintains it, and its primary purpose is to develop single-page applications. As a framework, Angular has clear advantages while also providing a standard structure for developers to work with. It enables users to create large applications in a maintainable manner.\n","section":"4. What Is Angular?","source":"https://www.simplilearn.com/"}],"5. What are the core building block of angular":[{"title":"What are the core building block of angular","content":"\nThe various building blocks of Angular are:\n\n- Components\n- Modules\n- Directives\n- Decorators\n- Pipes\n- Data Binding\n- Templates\n- Metadata\n- Services\n- Dependency Injection\n","section":"5. What are the core building block of angular","source":"https://angular.io"}],"6. Difference between Angular and AngularJS":[{"title":"Difference between Angular and AngularJS","content":"\nDifference between the AngularJS & Angular: Although, there are significant key differences between Angular JS & Angular:\n\n| AngularJS                                     | Angular                                                                           |\n| --------------------------------------------- | --------------------------------------------------------------------------------- |\n| It supports the Model-View-Controller design. | It uses components and directives. Components are the directives with a template. |\n| Written in JavaScript                         | Written in TypeScript                                                             |\n| Not a mobile friendly framework               | Angular is supported by all the popular mobile browsers.                          |\n| It does not use Dependency Injection.         | It support Dependency Injection.                                                  |\n","section":"6. Difference between Angular and AngularJS","source":"https://www.geeksforgeeks.org/"}],"7. What are templates in Angular":[{"title":"What are templates in Angular","content":"\nIn Angular, templates are the HTML that is used to render the application. It's responsible for the layout and content and how it is displayed in the UI. Every component has an HTML template that declares how that component renders. You define this template either inline or by file path. Angular extends HTML with additional syntax that lets you insert dynamic values from your component. Angular automatically updates the rendered DOM when your component's state changes.\n\n**Example of a angular template**\n\n```ts\n@Component({\n\tselector: 'my-app',\n\ttemplate: `\n\t\t<h1>Hello {{ name }}</h1>\n\t\t<p>This is some content</p>\n\t`,\n})\nexport class AppComponent {\n\tname = 'Angular'\n}\n```\n\nHere name is a property that is bound to the {{ name }} in the template. It's an syntax that is used to insert dynamic values into the template.\n","section":"7. What are templates in Angular","source":"https://angular.io"}],"8. What Is property binding in angular":[{"title":"What Is property binding in angular ?","content":"\nProperty binding in Angular helps you set values for properties of HTML elements or directives. Use property binding to do things such as toggle button functionality, set paths programmatically, and share values between components.\n\n**Example of Angular property binding**\n\n```ts\n@Component({\n\tselector: 'my-app',\n\ttemplate: ` <img [src]=\"imageUrl\" /> `,\n})\nexport class AppComponent {\n\timageUrl = 'https://picsum.photos/200/300'\n}\n```\n\nThe above code creates an Angular component that displays an image. The image's source is set to the value of the imageUrl property in the DOM node. A target property is the property of the DOM node that is set to the value of the imageUrl property.\n","section":"8. What Is property binding in angular","source":"https://angular.io"}],"9. What is the difference between properties and attributes in HTML?":[{"title":"What is the difference between properties and attributes in HTML?","content":"\nWhen writing HTML source code, you can define attributes on your HTML elements. Then, once the browser parses your code, a corresponding DOM node will be created. This node is an object, and therefore it has properties.\n\nFor instance, this HTML element:\n\n```html\n<input type=\"text\" name=\"name\" />\n```\n\nHas 2 attributes `(type and value)`.\nOnce the browser parses this code, a HTMLInputElement object will be created, and this object will contain dozens of properties like: accept, accessKey, align, alt, attributes, autofocus, baseURI, checked, childElementCount, childNodes, children, classList, className, clientHeight, etc.\n","section":"9. What is the difference between properties and attributes in HTML?","source":"https://stackoverflow.com"}]}